Repository: vetcoders/codescribe
Catalog: macos/Codescribe/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: pl

# mcp.server.disabled
source: Disabled
pl: Wyłączony

# mcp.server.enabled
source: Enabled
pl: Włączony

source: measured profile
pl: Profil kalibracji mikrofonu

source: measurement unavailable
pl: pomiar niedostępny

source: models folder
pl: folder modeli

source: no ax
pl: brak Dostępności

source: no capability rows (refresh or start agent substrate)
pl: Brak danych o możliwościach. Odśwież lub uruchom Agenta.

source: no composer receiver
pl: Nie można przekazać tekstu do edytora.

source: no insert
pl: nie wstawiono

source: no paste
pl: nie wklejono

source: no sealed utterance
pl: brak zatwierdzonej wypowiedzi

source: no speech
pl: brak mowy

source: not loaded yet
pl: jeszcze nie wczytano

source: nothing
pl: nic

source: now
pl: teraz

source: open System Settings
pl: otwórz Ustawienia systemowe

# overlay.intent.redo
source: Redo
pl: Ponów

# overlay.intent.redo.hint
source: Shows the next version again without running anything
pl: Pokazuje następną wersję bez ponownego uruchamiania czegokolwiek

# overlay.intent.undo
source: Undo
pl: Cofnij

# overlay.intent.undo.hint
source: Shows the previous version again without running anything
pl: Pokazuje poprzednią wersję bez ponownego uruchamiania czegokolwiek

# overlay.retranscribe.cloud
source: Cloud
pl: W chmurze

# overlay.retranscribe.local
source: Local
pl: Lokalnie

# overlay.versions.action.edit
source: edit
pl: edycję

# overlay.versions.action.format
source: format
pl: formatowanie

# overlay.versions.action.formatLevel
source: format (%@)
pl: formatowanie (%@)

# overlay.versions.action.retranscribe
source: retranscription
pl: ponowną transkrypcję

# overlay.versions.action.transcript
source: transcript
pl: transkrypcję

# overlay.versions.blocked.dirty
source: Save or discard your edit before choosing a version.
pl: Zapisz lub odrzuć edycję, zanim wybierzesz wersję.

# overlay.versions.blocked.pending
source: Wait for the current change to finish.
pl: Poczekaj, aż bieżąca zmiana się zakończy.

# overlay.versions.control
source: Transcript versions
pl: Wersje transkryptu

# overlay.versions.control.current
source: Transcript versions · shown: %@
pl: Wersje transkryptu · widoczna: %@

# overlay.versions.current
source: Current version
pl: Bieżąca wersja

# overlay.versions.error.navigate
source: Couldn't change the transcript version: %@
pl: Nie udało się zmienić wersji transkrypcji: %@

# overlay.versions.error.receipt
source: The transcript version change was not confirmed.
pl: Zmiana wersji transkrypcji nie została potwierdzona.

# overlay.versions.footer.linear
source: Choosing a version works like Undo and Redo. A new change after it replaces the versions above it.
pl: Wybór wersji działa jak Cofnij i Ponów. Nowa zmiana po nim zastępuje wersje powyżej.

# overlay.versions.redo.action
source: Redo %@
pl: Ponów %@

# overlay.versions.redo.none
source: Nothing to redo
pl: Nie ma czego ponowić

# overlay.versions.selectHint
source: Shows this version without running anything again
pl: Pokazuje tę wersję bez ponownego uruchamiania czegokolwiek

# overlay.versions.source.edited
source: Edited
pl: Edytowana

# overlay.versions.source.formatted
source: Formatted
pl: Sformatowana

# overlay.versions.source.formattedLevel
source: Formatted · %@
pl: Sformatowana · %@

# overlay.versions.source.original
source: Saved transcript
pl: Zapisana transkrypcja

# overlay.versions.source.other
source: Earlier version
pl: Wcześniejsza wersja

# overlay.versions.source.raw
source: Raw
pl: Surowa

# overlay.versions.source.retranscribed
source: Transcribed again
pl: Ponowna transkrypcja

# overlay.versions.title
source: Versions of this transcript
pl: Wersje tego transkryptu

# overlay.versions.undo.action
source: Undo %@
pl: Cofnij %@

# overlay.versions.undo.none
source: Nothing to undo
pl: Nie ma czego cofnąć

source: pasted
pl: wklejono

source: previous take copied
pl: skopiowano poprzednie nagranie

source: previous take discarded
pl: odrzucono poprzednie nagranie

source: previous take retained
pl: poprzednie nagranie zachowane

source: queued · waiting for receipt
pl: w kolejce · oczekiwanie na potwierdzenie odbioru

source: ran
pl: wywołano

source: raw
pl: surowy

source: reasoning summary
pl: podsumowanie rozumowania

source: receipt and managed folder found.
pl: znaleziono dane instalacji i folder zarządzany przez Codescribe.

source: receipt confirmed by the agent
pl: agent potwierdził odbiór

source: receipt found, managed folder missing or invalid — existing unowned folders will not be overwritten.
pl: Znaleziono dane instalacji, ale zarządzany folder nie istnieje lub jest nieprawidłowy. Codedcribe nie nadpisze istniejących folderów, którymi nie zarządza.

source: recover failed — kept
pl: odzyskiwanie nie powiodło się — tekst zachowany

source: request/response bodies not on this event
pl: Brak treści żądania i odpowiedzi dla tego zdarzenia.

source: result
pl: wynik

source: retranscribe returned no text
pl: ponowna transkrypcja nie zwróciła tekstu

source: retranscribe unavailable
pl: ponowna transkrypcja niedostępna

source: retranscribed
pl: transkrybowano ponownie

source: retranscribing · %@
pl: ponowna transkrypcja · %@

source: rewritten by your dictionary
pl: zmienione przez Twój słownik

source: rich
pl: bogaty

source: running
pl: w toku

source: saved correction
pl: zapisana poprawka

source: sent to Agent
pl: wysłano do Agenta

source: sent · waiting for receipt
pl: wysłano · oczekiwanie na potwierdzenie odbioru

# settings.formatting.level.off
source: Off
pl: Wyłączone

# settings.holdBadge.size.off
source: Off
pl: Wył.

# settings.paste.policy.off
source: Off
pl: Wyłączone

# settings.previewTiming.preset.off
source: No preview
pl: Bez podglądu

# settings.search.section.agent
source: tools, workspace, permissions, server, auto-send
pl: tools, workspace, permissions, server, auto-send, narzędzia, obszar roboczy, uprawnienia, serwer, automatyczne wysyłanie

# settings.search.section.audio
source: microphone, mikrofon, input, device, levels
pl: microphone, mikrofon, input, device, levels, wejście, urządzenie, poziomy, głośność

# settings.search.section.creator
source: setup, onboarding, permissions, quick start, language
pl: setup, onboarding, permissions, quick start, language, konfiguracja, pierwsze uruchomienie, uprawnienia, szybki start, język

# settings.search.section.engine
source: speech, transcription, cloud, consent
pl: speech, transcription, cloud, consent, mowa, transkrypcja, rozpoznawanie mowy, chmura, zgoda

# settings.search.section.keys
source: api key, provider, endpoint, model, token
pl: api key, provider, endpoint, model, token, klucz API, dostawca, adres API

# settings.search.section.license
source: subscription, activation, trial, billing
pl: subscription, activation, trial, billing, subskrypcja, abonament, aktywacja, okres próbny, płatności, rozliczenia

# settings.search.section.shortcuts
source: hotkey, keyboard, shortcut, trigger, hold, toggle
pl: hotkey, keyboard, shortcut, trigger, hold, toggle, skrót, klawiatura, skrót klawiszowy, wywołanie, przytrzymanie, przełączanie

# settings.search.section.user
source: about, version, build, commit, data folder, privacy, reset, trash
pl: about, version, build, commit, data folder, privacy, reset, trash, o aplikacji, wersja, kompilacja, dane, prywatność, reset, kosz

# settings.search.section.voiceLab
source: lexicon, dictionary, vocabulary, corrections, słownik
pl: lexicon, dictionary, vocabulary, corrections, słownik, leksykon, słownictwo, poprawki

# settings.search.tab.agentLanes
source: provider, model, endpoint, assistive, formatting
pl: provider, model, endpoint, assistive, formatting, dostawca, adres API, asystent, formatowanie

# settings.search.tab.agentMcp
source: server, transport
pl: server, transport, serwer, połączenie, sposób połączenia

# settings.search.tab.agentPrompts
source: prompt, system prompt, persona, instructions, assistive, correction, smart, max
pl: prompt, system prompt, persona, instructions, assistive, correction, smart, max, prompt systemowy, osobowość, instrukcje, korekta, redakcja, formatowanie

# settings.search.tab.agentTools
source: permission, allow, ask, deny, tool
pl: permission, allow, ask, deny, tool, uprawnienia, zezwalaj, zgoda, pytaj, blokuj, narzędzie, narzędzia

# settings.search.tab.dictationEngine
source: engine, runtime
pl: engine, runtime, silnik, działanie, uruchomienie

# settings.search.tab.dictationPermissions
source: permission, accessibility, input monitoring
pl: permission, accessibility, input monitoring, uprawnienia, dostępność, monitorowanie wprowadzania, monitorowanie wejścia

# settings.search.tab.dictationPreview
source: preview, timing, pace, typing, cadence, overlay
pl: preview, timing, pace, typing, cadence, overlay, podgląd, opóźnienie, pisanie, tempo, odświeżanie

# settings.search.tab.dictationPrivacy
source: cloud, privacy, consent, egress
pl: cloud, privacy, consent, egress, chmura, prywatność, zgoda, wysyłanie danych

# settings.search.tab.dictationWhisper
source: model, download, local
pl: model, download, local, pobieranie, pobierz, lokalny

# settings.shortcuts.conflict.doubleCtrlBlocksLeftOption
source: Dictation uses 2× Ctrl, so the left Option gesture cannot start a take.
pl: Dyktowanie używa 2× Ctrl, więc gest lewego Option nie uruchomi nagrania.

# settings.shortcuts.conflict.doubleCtrlBlocksRightOption
source: Dictation uses 2× Ctrl, so the right Option gesture cannot start a take.
pl: Dyktowanie używa 2× Ctrl, więc gest prawego Option nie uruchomi nagrania.

# settings.shortcuts.conflict.macosSystemShortcut
source: This gesture is already taken by a macOS system shortcut.
pl: Ten gest jest już zajęty przez skrót systemowy macOS.

# settings.shortcuts.conflict.onlyAgentNotDictation
source: 2× Right ⌥ starts only the Agent, so Dictation would never start. Dictation starts with a hold or 2× Ctrl.
pl: 2× prawy ⌥ uruchamia tylko Agenta, więc Dyktowanie nigdy by nie ruszyło. Dyktowanie uruchamia przytrzymanie albo 2× Ctrl.

# settings.shortcuts.conflict.onlyAgentNotFormatting
source: 2× Right ⌥ starts only the Agent, so Formatting would never start. Formatting starts with 2× Left ⌥.
pl: 2× prawy ⌥ uruchamia tylko Agenta, więc Formatowanie nigdy by nie ruszyło. Formatowanie uruchamia 2× lewy ⌥.

# settings.shortcuts.conflict.onlyDictationNotAgent
source: This gesture starts only Dictation, so the Agent would never start. The Agent starts with 2× Right ⌥.
pl: Ten gest uruchamia tylko Dyktowanie, więc Agent nigdy by nie ruszył. Agenta uruchamia 2× prawy ⌥.

# settings.shortcuts.conflict.onlyDictationNotFormatting
source: This gesture starts only Dictation, so Formatting would never start. Formatting starts with 2× Left ⌥.
pl: Ten gest uruchamia tylko Dyktowanie, więc Formatowanie nigdy by nie ruszyło. Formatowanie uruchamia 2× lewy ⌥.

# settings.shortcuts.conflict.onlyFormattingNotAgent
source: 2× Left ⌥ starts only Formatting, so the Agent would never start. The Agent starts with 2× Right ⌥.
pl: 2× lewy ⌥ uruchamia tylko Formatowanie, więc Agent nigdy by nie ruszył. Agenta uruchamia 2× prawy ⌥.

# settings.shortcuts.conflict.onlyFormattingNotDictation
source: 2× Left ⌥ starts only Formatting, so Dictation would never start. Dictation starts with a hold or 2× Ctrl.
pl: 2× lewy ⌥ uruchamia tylko Formatowanie, więc Dyktowanie nigdy by nie ruszyło. Dyktowanie uruchamia przytrzymanie albo 2× Ctrl.

# settings.shortcuts.note.fnTapOwnedByMacos
source: The Fn key is also configured in macOS. Codescribe may intercept its short press while dictation is running. This note does not block saving the shortcuts.
pl: Klawisz Fn jest również skonfigurowany w macOS. Podczas dyktowania Codescribe może przechwycić jego krótkie naciśnięcie. Ta uwaga nie blokuje zapisu skrótów.

# settings.shortcuts.save.rejected
source: Not saved: %@. The gesture in effect is unchanged.
pl: Nie zapisano: %@. Obowiązuje nadal poprzedni gest.

# settings.shortcuts.save.saved
source: Saved: %@.
pl: Zapisano: %@.

source: source: %@
pl: źródło: %@

source: status unavailable
pl: status niedostępny

# status.tone.bad
source: Error
pl: Błąd

# status.tone.good
source: Good
pl: Gotowe

# status.tone.neutral
source: Not checked
pl: Nie sprawdzono

# status.tone.warn
source: Warning
pl: Ostrzeżenie

source: stopped
pl: zatrzymano

source: streaming
pl: na żywo

source: succeeded
pl: Zakończono pomyślnie

source: take audio unavailable
pl: dźwięk nagrania niedostępny

source: take changed
pl: nagranie zmienione

source: the Codescribe-managed marker is missing or does not match this client and bridge root
pl: Brakuje znacznika zarządzania Codescribe lub nie pasuje on do tej aplikacji agenta i lokalizacji Agent Bridge.

source: thinking...
pl: myśli...

source: thinking…
pl: myśli…

source: today %@
pl: dzisiaj %@

source: tool
pl: narzędzie

source: tool: %@ · source: %@
pl: narzędzie: %1$@ · źródło: %2$@

# tray.keycap.off
source: Off
pl: Wył.

# tray.keycap.on
source: On
pl: Wł.

source: unavailable
pl: niedostępne

source: uncertain
pl: niepewne

source: undo failed — kept
pl: cofnięcie nie powiodło się — zachowano bieżącą wersję

source: undo unavailable
pl: cofnięcie niedostępne

source: unresolved
pl: nie udało się ustalić modelu

source: unsaved edit copied
pl: skopiowano niezapisaną zmianę

source: unsaved edit discarded
pl: odrzucono niezapisaną zmianę

source: unsaved work reopened
pl: przywrócono niezapisaną pracę

source: unsealed transcript
pl: transkrypcja niezatwierdzona

source: unset
pl: nie ustawiono

source: unverified coverage
pl: pokrycie mowy niezweryfikowane

source: using cached models
pl: korzystanie z zapisanej listy modeli

source: using cached models — %@
pl: korzystanie z zapisanej listy modeli — %@

source: worked · %@s
pl: pracował · %@ s

source: xAI (Grok) API key
pl: Klucz API xAI (Grok)

source: yesterday
pl: wczoraj
